# Feature Engineering
Featur enengineering is the process of using domain knowladge to extract features from raw data. Thease feature can be used to improve the performance of machine learning algorithms.

The process of selecting, manipulating, and transforming raw data into features that can be used in supervised learning to improve machine learning model performance. 

Processes Involved in Feature Engineering
1. Feature Transformation:
   
   Feature Transformation is the process of transforming the features into a more suitable representation for the machine learning model.
   
    * missing values
    * handling categorical values
    * Outliers Detection
    * Feature Scaling
3. Feature construction:

    Feature Creation is the process of generating new features based on domain knowledge      or by observing patterns in the data.
4.  Feature Selection:

      Feature Selection is the process of selecting a subset of relevant features from the dataset to be used in a machine-learning model. 
  
5.  Feature Extraction

     Feature Extraction is the process of creating new features from existing ones to provide more relevant information to the machine learning model.

# Feature Scalling
It is a technique to standerdization the independent feature present in the data in a fixed range.

Types:
* Standardization
* Normalization

## Standardization - Intuition
  Also called as Z-score Normalization
 Standardization or Z-Score Normalization is the transformation of features by subtracting from mean and dividing by standard deviation. This is often called as Z-score.
  
X_new = (X - mean)/Std

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("Social_Network_Ads.csv")

In [3]:
df.head()

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0
2   26            43000          0
3   27            57000          0
4   19            76000          0

In [5]:
df.iloc[:,2:]

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [8]:
df.sample(5)

     Age  EstimatedSalary  Purchased
362   47            50000          1
393   60            42000          1
339   39           122000          1
158   26            30000          0
268   47           144000          1

# Train test split

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df.drop("purchased", axis=1),df["purchased"], test_size=0.3, random_state=0)

X_train.shape, X_test.shape